silk-indus/esp32Radio_V2/include/SDcard.h
  //**************************************************************************************************
  //                                  H A N D L E _ I D 3 _ S D                                      *
  //**************************************************************************************************
  // Check file on SD card for ID3 tags and use them to display some info.                           *
  // Extended headers are not parsed.                                                                *
  //**************************************************************************************************
  void handle_ID3_SD ( String &path )
  {
    char*  p ;                                                // Pointer to filename
    struct ID3head_t                                          // First part of ID3 info
    {
      char    fid[3] ;                                        // Should be filled with "ID3"
      uint8_t majV, minV ;                                    // Major and minor version
      uint8_t hflags ;                                        // Headerflags
      uint8_t ttagsize[4] ;                                   // Total tag size
    } ID3head ;
    uint8_t  exthsiz[4] = { 0, 0, 0, 0 } ;                    // Extended header size
    uint32_t stx ;                                            // Ext header size converted
    uint32_t sttg ;                                           // Total tagsize converted
    uint32_t stg ;                                            // Size of a single tag
    uint32_t audioOffset = 0 ;                                // First byte after complete ID3v2 tag
    struct ID3tag_t                                           // Tag in ID3 info
    {
      char    tagid[4] ;                                      // Things like "TCON", "TYER", ...
      uint8_t tagsize[4] ;                                    // Size of the tag
      uint8_t tagflags[2] ;                                   // Tag flags
    } ID3tag ;
    uint8_t   tmpbuf[4] ;                                     // Scratch buffer
    uint8_t   tenc ;                                          // Text encoding
    String    artist = String() ;                              // Artist shown below the title
    bool      tpe1 ;                                          // Tag is TPE1 (artist)

    SD_cover_offset = 0 ;                                      // No cover until APIC proves otherwise
    SD_cover_length = 0 ;
    SD_cover_visible = false ;
    tftset ( 2, "" ) ;                                        // Assume no artist tag
    p = (char*)path.c_str() + 1 ;                             // Point to filename (after the slash)
    showstreamtitle ( p, true ) ;                             // Show the filename as title (middle part)
    mp3file = SD.open ( path ) ;                              // Open the file
    mp3file.read ( (uint8_t*)&ID3head, sizeof(ID3head) ) ;    // Read first part of ID3 info
    if ( strncmp ( ID3head.fid, "ID3", 3 ) == 0 )
    {
      sttg = ssconv ( ID3head.ttagsize ) ;                    // Convert tagsize
      audioOffset = sizeof(ID3head) + sttg ;                  // Skip payload, padding and cover art
      if ( ID3head.hflags & 0x10 ) audioOffset += 10 ;        // Optional ID3v2 footer
      ESP_LOGI ( STAG, "Found ID3 info" ) ;
      if ( ID3head.hflags & 0x40 )                            // Extended header?
      {
        mp3file.read ( exthsiz, sizeof(exthsiz) ) ;           // Read its encoded size first
        stx = ssconv ( exthsiz ) ;                            // Get size of extended header
        if ( stx > sttg ) stx = sttg ;                        // Reject corrupt lengths
        while ( stx-- )
        {
          mp3file.read () ;                                   // Skip next byte of extended header
        }
      }
      while ( sttg > 10 )                                     // Now handle the tags
      {
        sttg -= mp3file.read ( (uint8_t*)&ID3tag,
                              sizeof(ID3tag) ) ;              // Read first part of a tag
        if ( ID3tag.tagid[0] == 0 )                           // Reached the end of the list?
        {
          break ;                                             // Yes, quit the loop
        }
        stg = ID3head.majV >= 4 ? ssconv ( ID3tag.tagsize ) : // ID3v2.4 uses synchsafe sizes
              ( (uint32_t)ID3tag.tagsize[0] << 24 ) |
              ( (uint32_t)ID3tag.tagsize[1] << 16 ) |
              ( (uint32_t)ID3tag.tagsize[2] << 8 ) |
                (uint32_t)ID3tag.tagsize[3] ;                 // ID3v2.3 uses big endian
        if ( stg > sttg ) break ;                             // Corrupt frame length
        if ( ID3tag.tagflags[1] & 0x08 )                      // Compressed?
        {
          sttg -= mp3file.read ( tmpbuf, 4 ) ;                // Yes, ignore 4 bytes
          stg -= 4 ;                                          // Reduce tag size
        }
        if ( ID3tag.tagflags[1] & 0x044 )                     // Encrypted or grouped?
        {
          sttg -= mp3file.read ( tmpbuf, 1 ) ;                // Yes, ignore 1 byte
          stg-- ;                                             // Reduce tagsize by 1
        }
        uint32_t payloadStart = mp3file.position() ;
        if ( strncmp ( ID3tag.tagid, "APIC", 4 ) == 0 && stg > 5 )
        {
          // APIC: encoding, MIME\0, picture type, description terminator, JPEG bytes.
          // Store an offset only; key 0 opens a second SD handle and streams the JPEG to the TFT.
          uint32_t left = stg ;
          uint8_t encoding = mp3file.read() ; left-- ;
          String mime ;
          while ( left )
          {
            int c = mp3file.read() ; left-- ;
            if ( c <= 0 ) break ;
            if ( mime.length() < 31 ) mime += (char)c ;
          }
          if ( left ) { mp3file.read() ; left-- ; }           // Picture type
          if ( encoding == 0 || encoding == 3 )               // ISO-8859-1 or UTF-8 description
          {
            while ( left && mp3file.read() != 0 ) left-- ;
            if ( left ) left-- ;
          }
          else                                                // UTF-16 description ends in 00 00
          {
            int previous = -1 ;
            while ( left )
            {
              int c = mp3file.read() ; left-- ;
              if ( previous == 0 && c == 0 ) break ;
              previous = c ;
            }
          }
          mime.toLowerCase() ;
          uint32_t imageOffset = mp3file.position() ;
          uint8_t jpegMagic[2] = { 0, 0 } ;
          bool jpeg = left > 2 && mp3file.read ( jpegMagic, sizeof(jpegMagic) ) == sizeof(jpegMagic) &&
                      jpegMagic[0] == 0xFF && jpegMagic[1] == 0xD8 ;
          mp3file.seek ( imageOffset ) ;
          if ( jpeg )                                          // Trust JPEG SOI even if MIME is nonstandard
          {
            SD_cover_offset = imageOffset ;
            SD_cover_length = left ;
            ESP_LOGI ( STAG, "Embedded JPEG cover found, %lu bytes, MIME %s",
                       (unsigned long)SD_cover_length, mime.c_str() ) ;
          }
          mp3file.seek ( payloadStart + stg ) ;
          sttg -= stg ;
          continue ;
        }
        if ( stg > ( sizeof(metalinebf) - 1 ) )                // Room for text tag?
        {
          mp3file.seek ( payloadStart + stg ) ;                // Skip large unknown/binary frame
          sttg -= stg ;
          continue ;
        }
        sttg -= mp3file.read ( (uint8_t*)metalinebf,
                               stg ) ;                        // Read tag contents
        metalinebf[stg] = '\0' ;                              // Add delimeter
        tenc = metalinebf[0] ;                                // First byte is encoding type
        if ( tenc == '\0' )                                   // Debug all tags with encoding 0
        {
          ESP_LOGI ( STAG, "ID3 %s = %s", ID3tag.tagid,
                    metalinebf + 1 ) ;
        }
        tpe1 = ( strncmp ( ID3tag.tagid, "TPE1", 4 ) == 0 ) ; // Artist?
        if ( tpe1 )                                           // Artist?
        {
          artist = String ( metalinebf + 1 ) ;                // Artist is the lower field
          icyname = artist ;                                  // Also use in web interface
        }
        if ( strncmp ( ID3tag.tagid, "TIT2", 4 ) == 0 )       // Songtitle?
        {
          tftset ( 1, metalinebf + 1 ) ;                      // Song title is the upper field
          icystreamtitle = String ( metalinebf + 1 ) ;        // For status in webinterface
        }
      }
      tftset ( 2, artist ) ;                                  // Artist is below the song title
      if ( audioOffset < mp3file.size() )
      {
        mp3file.seek ( audioOffset ) ;                        // Probe and play from first audio frame
      }
    }
    else
    {
      mp3file.seek ( 0 ) ;                                    // No ID3: restore bytes used for probing
    }
  }


  //**************************************************************************************************
  //                                  C O N N E C T T O F I L E _ S D                                *
  //**************************************************************************************************
  // Open the local mp3-file.                                                                        *
  //**************************************************************************************************
  bool connecttofile_SD()
  {
    String path ;                                           // Full file spec

    stop_mp3client() ;                                      // Disconnect if still connected
    SD_playing = false ;                                    // Reset progress until file is ready
    SD_totalbytes = 0 ;
    SD_bitrate = 0 ;
    SD_duration = 0 ;
    #ifdef BLUETFT
      displayplaytime ( "" ) ;                           // New track starts a new counter
    #endif
    tftset ( 0, "" ) ;                                      // Top-left field will show played/length
    displaytime ( "" ) ;                                    // Clear time on TFT screen
    setdatamode ( DATA ) ;                                  // Start in datamode 
    path = String ( getCurrentSDFileName() ) ;              // Set path to file to play
    icystreamtitle = path ;                                 // If no ID3 available
    icyname = String ( "" ) ;                               // If no ID3 available
    handle_ID3_SD ( path ) ;                                // See if there are ID3 tags in this file
    if ( !mp3file )
    {
      ESP_LOGI ( STAG, "Error opening file %s",             // No luck
                 path.c_str() ) ;
      return false ;
    }
    size_t audioStart = mp3file.position() ;                // Position after the ID3 tag
    SD_audio_start = audioStart ;                            // Required for relative seeking
    static uint8_t probe[1024] ;                            // First MPEG frame and VBR headers
    size_t probeLength = mp3file.read ( probe, sizeof(probe) ) ;
    SD_bitrate = detectSDMP3Bitrate ( probe, probeLength ) ;
    SD_duration = detectSDMP3Duration ( probe, probeLength ) ;
    mp3file.seek ( audioStart ) ;                           // Probe must not consume audio
    mp3filelength = mp3file.available() ;                   // Remaining audio bytes
    SD_totalbytes = mp3filelength ;
    SD_playing = true ;
    String progressText = getSDProgressText() ;
    tftset ( 0, progressText ) ;                            // Replace "MP3 Player"
    ESP_LOGI ( STAG, "MP3 progress: %s, bitrate %u kbps%s",
               progressText.c_str(), SD_bitrate,
               SD_duration ? ", exact VBR length" : "" ) ;
    mqttpub.trigger ( MQTT_STREAMTITLE ) ;                  // Request publishing to MQTT
    chunked = false ;                                       // File not chunked
    metaint = 0 ;                                           // No metadata
    return true ;
  }


  //**************************************************************************************************
  //                                       M O U N T _ S D C A R D                                   *
  //**************************************************************************************************
  // Initialize the SD card.                                                                         *
  //**************************************************************************************************
  bool mount_SDCARD ( int8_t csPin )
  {
    bool       okay = false ;                              // True if SD card in place and readable

    if ( csPin >= 0 )                                      // SD configured?
    {
      SD_mounted = SD.begin ( csPin, SPI,                  // Yes, try to init SD card driver
                              SDSPEED, "/sd", 3 ) ;
      if ( !SD_mounted )                                   // Init (mount) okay?
      {
        //ESP_LOGE ( STAG, "SD Card Mount Failed!" ) ;     // No success, check formatting (FAT)
      }
      else
      {
        okay = ( SD.cardType() != CARD_NONE ) ;            // See if known card
      }
    }
    if ( !okay )
    {
      ESP_LOGI ( STAG, "No SD card attached" ) ;           // Card not readable
    }
    return okay ;
  }


  //**************************************************************************************************
  //                                       C L O S E _ S D C A R D                                   *
  //**************************************************************************************************
  // Close file on SD card.                                                                          *
  //**************************************************************************************************
  void close_SDCARD()
  {
    ESP_LOGI ( STAG, "Close SD file" ) ;
    SD_playing = false ;
    SD_cover_visible = false ;
    SD_seek_seconds = 0 ;
    mp3file.close() ;                                     // Close the file
  }


  //**************************************************************************************************
  //                                   S D I N S E R T C H E C K                                     *
  //**************************************************************************************************
  // Check if new SD card is inserted and can be read.                                               *
  //**************************************************************************************************
  bool SDInsertCheck()
  {
    static uint32_t nextCheckTime = 0 ;                     // To prevent checking too often
    uint32_t        newmillis ;                             // Current timestamp
    bool            sdinsNew ;                              // Result of insert check
    void*           p ;                                     // Pointer to item from ringbuffer
    size_t          f0 ;                                    // Length of item from ringbuffer
    static bool     sdInserted = false ;                    // Yes, flag for inserted SD
    int8_t          dpin = ini_block.sd_detect_pin ;        // SD inserted detect pin

