silk-indus/esp32Radio_V2/include/SDcard.h
    if ( ( newmillis = millis() ) < nextCheckTime )         // Time to check?
    {
      return false ;                                        // No, return "no new insert"
    }
    nextCheckTime = newmillis + 5000 ;                      // Yes, set new check time
    if ( dpin >= 0 )                                        // Hardware detection possible?
    {
      sdinsNew = ( digitalRead ( dpin ) == LOW ) ;          // Yes, see if card inserted
      if ( sdinsNew == sdInserted )                         // Situation changed?
      {
        return false ;                                      // No, return "no new insert"
      }
      else
      {
        sdInserted = sdinsNew ;                             // Remember status
        if ( ! sdInserted )                                 // Card out?
        {
          ESP_LOGI ( STAG, "SD card removed" ) ;
          if ( SD_mounted )                                 // Still mounted?
          {
            SD.end() ;                                      // Unmount SD card
            SD_okay = false ;                               // Not okay anymore
            SD_mounted = false ;                            // And not mounted anymore
          }
        }
        else                                                // Card inserted
        {
          ESP_LOGI ( STAG, "SD card inserted" ) ;
          SD_okay = mount_SDCARD ( ini_block.sd_cs_pin ) ;  // Try to mount
        }
      }
    }
    else                                                    // Handle SD without detect pin
    {
      ESP_LOGI ( STAG, "Try to mount SD card" ) ;
      SD_okay = mount_SDCARD ( ini_block.sd_cs_pin ) ;      // Try to mount
    }
    return SD_okay ;                                        // Return result
  }


  //**************************************************************************************************
  //                                    C O U N T F I L E S                                          *
  //**************************************************************************************************
  // Count number of tracks in the track list.                                                       *
  //**************************************************************************************************
  int countfiles()
  {
    int count = 0 ;                                         // Files found
  
    while ( trackfile.available() > 1 )
    {
      uint8_t* pm = (uint8_t*)&mp3entry ;                   // Point to entrylength of mp3entry
      trackfile.read ( pm, sizeof(mp3entry.entrylen) ) ;    // Get total size of entry
      pm += sizeof(mp3entry.entrylen) ;                     // Bump pointer
      trackfile.read ( pm, mp3entry.entrylen -              // Read rest of entry
                        sizeof ( mp3entry.entrylen ) ) ;
      count++ ;                                             // count entries
      vTaskDelay ( 10 / portTICK_PERIOD_MS  ) ;             // Allow other tasks
    }
    ESP_LOGI ( STAG, "%d files on SD card", count ) ;
    return count ;                                          // Return number of tracks
  }


  //**************************************************************************************************
  //                                       S D T A S K                                               *
  //**************************************************************************************************
  // This task will constantly try to fill the ringbuffer with filenames on SD.                      *
  // if the SD detect pin is defined, a test will on SD change will be performed every 5 seconds.    *
  // Otherwise, the check is made only once, after reset.                                            *
  //**************************************************************************************************
  void SDtask ( void * parameter )
  {
    const char* ffn ;                                     // First filename on SD card
    int8_t      dpin = ini_block.sd_detect_pin ;          // SD inserted detect pin
    bool        once = true ;                             // Always check once
  
    vTaskDelay ( 1000 / portTICK_PERIOD_MS ) ;            // Start delay
    while ( true )                                        // Endless task
    {
      vTaskDelay ( 200 / portTICK_PERIOD_MS ) ;           // Allow other tasks
      if ( ( dpin < 0 ) && ( once == false ) )            // Just one check if no detect pin
      {
        continue ;
      }
      once = false ;                                      // Stop detect without detect pin
      if ( SDInsertCheck() )                              // See if new card is inserted
      {
        SD_lastmp3spec[0] = '\0' ;                        // No last track
        if ( ( openTrackfile() ) &&                       // Try to open trackfile
             ( trackfile.size() > 0 ) )                   // Tracklist on this SD card?
        {
          ESP_LOGI ( STAG, "Track list is on SD card, "   // Yes, show it
                     "read tracks" ) ;
          SD_filecount = countfiles() ;                   // Count number of files on this card
          closeTrackfile() ;                              // Close the tracklist file
          ESP_LOGI ( STAG, "%d tracks on SD card",        // Yes, show it
                     SD_filecount ) ;
        }
        else
        {
          ESP_LOGI ( STAG, "Locate mp3 files on SD, "
                     "may take a while..." ) ;
          if ( openTrackfile ( FILE_WRITE ) )             // Try to open trackfile for write
          {
            SD_okay = getsdtracks ( "/", SD_MAXDEPTH ) ;  // Get filenames, store on the SD card
            closeTrackfile() ;                            // Close the tracklist file
          }
        }
        ffn = getFirstSDFileName() ;
        if ( ffn )
        {
          ESP_LOGI ( STAG, "First file on SD card is %s", // Show the first track name
                     ffn ) ;
        }
      }
    }
  }
#endif
